app/views/carts/_form.html.erb

SELECT `courses`.* FROM `courses`
---
    <%= form.label :course_id %>
    <%= form.collection_select :course_id, Course.all, :id, :name, prompt: "Seleccione curso"%>