app/controllers/buy_points_controller.rb

	def show
		@user = User.find(current_user.id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1

	def update
		#params.require(:user).permit(:points)
		@user = User.find(current_user.id)
		total_points = @user.points.to_i + params[:points].to_i
		@user.update_attributes(points: total_points)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `points` = NULL, `updated_at` = '2017-06-20 03:49:33' WHERE `users`.`id` = 2