app/controllers/carts_controller.rb

  def index
    @carts = Cart.all
---
SELECT `carts`.* FROM `carts`

  def create
    @cart = Cart.new
    @cart.user_id = current_user.id
    @cart.course_id = params[:course_id]
    @cart.quantity = 1

    respond_to do |format|
      if @cart.save
---
INSERT INTO `carts` (`user_id`, `course_id`, `quantity`, `created_at`, `updated_at`) VALUES (2, 19, 1, '2017-06-19 20:21:20', '2017-06-19 20:21:20')

  def destroy
    @cart.destroy
---
DELETE FROM `carts` WHERE `carts`.`id` = 1

  def destroy_cart
    @carts = Cart.all
    @user = User.find(current_user.id)
---
SELECT `carts`.* FROM `carts`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

    def set_cart
      @cart = Cart.find(params[:id])
---
SELECT  `carts`.* FROM `carts` WHERE `carts`.`id` = 1 LIMIT 1