app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT `courses`.* FROM `courses`

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`name`, `description`, `price`, `category`, `created_at`, `updated_at`) VALUES ('Los Griegos', 'Li Europan lingues es membres del sam familie. Lor separat existentie es un myth. Por scientie, musica, sport etc, litot Europa usa li sam vocabular. Li lingues differe solmen in li grammatica, li pronunciation e li plu commun vocabules. Omnicos directe al desirabilite de un nov lingua franca: On refusa continuar payar custosi traductores. At solmen va esser necessi far uniform grammatica, pronunciation e plu sommun paroles. Ma quande lingues coalesce, li grammatica del resultant lingue es plu simplic e regulari quam ti del coalescent lingues. Li nov lingua franca va esser plu simplic e regulari quam li existent Europan lingues. It va esser tam simplic quam Occidental in fact, it va esser Occidental. A un Angleso it va semblar u', 5200, 'historia', '2017-06-15 23:04:02', '2017-06-15 23:04:02')

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE `courses` SET `description` = 'm familie. Lor separat existentie es un myth. Por scientie, musica, sport etc, litot Europa usa li sam vocabular. Li lingues differe ', `updated_at` = '2017-06-16 02:10:20' WHERE `courses`.`id` = 1

  def destroy
    @course.destroy
---
DELETE FROM `courses` WHERE `courses`.`id` = 1

    def set_course
      @course = Course.find(params[:id])
---
SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1