app/controllers/purchases_controller.rb

SELECT `purchases`.* FROM `purchases`
---
  def index
    @purchases = Purchase.all

SELECT `carts`.* FROM `carts` WHERE (user_id = current_user.id)
SELECT  `carts`.* FROM `carts` WHERE `carts`.`id` = 32 LIMIT 1
INSERT INTO `purchases` (`user_id`, `course_id`, `quantity`, `price`, `cart_id`, `created_at`, `updated_at`) VALUES (2, 19, 1, 200, 32, '2017-07-05 02:50:34', '2017-07-05 02:50:34')
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `points` = 77180, `updated_at` = '2017-07-05 19:46:46' WHERE `users`.`id` = 2
DELETE FROM `carts` WHERE `carts`.`id` = 32
DELETE FROM `purchases` WHERE `purchases`.`id` = 1
---
  def create
   @carts = Cart.where(user_id: current_user.id)

    @carts.each do |cart|
      @purchase = Purchase.new
      @purchase.user_id = current_user.id
      nuevo = @purchase.cart_id.to_s.dup.to_i
      @purchase.course_id = cart.course_id
      nuevo = cart.id
      @purchase.save
    end

    @carts = Cart.all
    @user = User.find(current_user.id)
    @total = params[:total].to_i
    @user_points = current_user.points

    if @user_points >= @total

      @user.update_attribute(:points, @user_points - @total)

      @carts.each do |cart|
        cart.destroy

SELECT  `purchases`.* FROM `purchases` WHERE `purchases`.`id` = 0 LIMIT 1
---
    def set_purchase
      @purchase = Purchase.find(params[:id])